### Terraform Initialization `success`

### Terraform Validation `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

### Terraform Plan `success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
  + create

Terraform will perform the following actions:

  # module.dev-net-firewall-policy.google_compute_firewall_policy.hierarchical[0] will be created
  + resource "google_compute_firewall_policy" "hierarchical" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + firewall_policy_id = (known after apply)
      + id                 = (known after apply)
      + name               = (known after apply)
      + parent             = "folders/608928149506"
      + rule_tuple_count   = (known after apply)
      + self_link          = (known after apply)
      + self_link_with_id  = (known after apply)
      + short_name         = "dev-net-policies"
    }

  # module.dev-net-firewall-policy.google_compute_firewall_policy_association.hierarchical["networkroot"] will be created
  + resource "google_compute_firewall_policy_association" "hierarchical" {
      + attachment_target = "folders/608928149506"
      + firewall_policy   = (known after apply)
      + id                = (known after apply)
      + name              = "dev-net-policies-networkroot"
      + short_name        = (known after apply)
    }

  # module.dev-net-firewall-policy.google_compute_firewall_policy_rule.hierarchical["ingress/in-allow-dapp1-dsvc1"] will be created
  + resource "google_compute_firewall_policy_rule" "hierarchical" {
      + action             = "allow"
      + creation_timestamp = (known after apply)
      + description        = "Allow all from DevApp1 to DevSvc1"
      + direction          = "INGRESS"
      + disabled           = false
      + firewall_policy    = (known after apply)
      + id                 = (known after apply)
      + kind               = (known after apply)
      + priority           = 3001
      + rule_tuple_count   = (known after apply)

      + match {
          + dest_ip_ranges = [
              + "10.3.11.0/24",
            ]
          + src_ip_ranges  = [
              + "10.3.21.0/24",
            ]

          + layer4_configs {
              + ip_protocol = "tcp"
              + ports       = []
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "universe" but a value was

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Value for undeclared variable

The root module does not declare a variable named "root_folder_id" but a

To silence these warnings, use TF_VAR_... environment variables to provide

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 6 other variable(s) defined


Saved the plan to: ../plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "../plan.out"
```

</details>

### Terraform Apply `skipped`

*Pusher: @leorocca-gg, Action: `pull_request`, Working Directory: ``, Workflow: `FAST networking stage`*